/* automatically generated by rust-bindgen 0.71.1 */

pub type cec_abort_reason = ::std::os::raw::c_int;
pub type cec_analogue_broadcast_type = ::std::os::raw::c_int;
pub type cec_audio_rate = ::std::os::raw::c_int;
pub type cec_audio_status = ::std::os::raw::c_int;
pub type cec_boolean = ::std::os::raw::c_int;
pub type cec_version = ::std::os::raw::c_int;
pub type cec_channel_identifier = ::std::os::raw::c_int;
pub type cec_deck_control_mode = ::std::os::raw::c_int;
pub type cec_deck_info = ::std::os::raw::c_int;
pub type cec_device_type = ::std::os::raw::c_int;
pub type cec_display_control = ::std::os::raw::c_int;
pub type cec_external_source_specifier = ::std::os::raw::c_int;
pub type cec_menu_request_type = ::std::os::raw::c_int;
pub type cec_menu_state = ::std::os::raw::c_int;
pub type cec_play_mode = ::std::os::raw::c_int;
pub type cec_power_status = ::std::os::raw::c_int;
pub type cec_record_source_type = ::std::os::raw::c_int;
pub type cec_record_status_info = ::std::os::raw::c_int;
pub type cec_recording_sequence = ::std::os::raw::c_int;
pub type cec_status_request = ::std::os::raw::c_int;
pub type cec_system_audio_status = ::std::os::raw::c_int;
pub type cec_timer_cleared_status_data = ::std::os::raw::c_int;
pub type cec_timer_overlap_warning = ::std::os::raw::c_int;
pub type cec_media_info = ::std::os::raw::c_int;
pub type cec_programmed_indicator = ::std::os::raw::c_int;
pub type cec_programmed_info = ::std::os::raw::c_int;

pub const cec_opcode_CDC: cec_opcode = 248;
pub const cec_opcode_NONE: cec_opcode = 253;
pub const cec_log_level_CEC_LOG_ERROR: cec_log_level = 1;
pub const cec_log_level_CEC_LOG_WARNING: cec_log_level = 2;
pub const cec_log_level_CEC_LOG_NOTICE: cec_log_level = 4;
pub const cec_log_level_CEC_LOG_TRAFFIC: cec_log_level = 8;
pub const cec_log_level_CEC_LOG_DEBUG: cec_log_level = 16;
pub const cec_log_level_CEC_LOG_ALL: cec_log_level = 31;
pub const cec_bus_device_status_UNKNOWN: cec_bus_device_status = 0;
pub const cec_bus_device_status_PRESENT: cec_bus_device_status = 1;
pub const cec_bus_device_status_NOT_PRESENT: cec_bus_device_status = 2;
pub const cec_bus_device_status_HANDLED_BY_LIBCEC: cec_bus_device_status = 3;
pub const cec_vendor_id_TOSHIBA: cec_vendor_id = 57;
pub const cec_vendor_id_SAMSUNG: cec_vendor_id = 240;
pub const cec_vendor_id_DENON: cec_vendor_id = 1485;
pub const cec_vendor_id_MARANTZ: cec_vendor_id = 1656;
pub const cec_vendor_id_LOEWE: cec_vendor_id = 2434;
pub const cec_vendor_id_ONKYO: cec_vendor_id = 2480;
pub const cec_vendor_id_MEDION: cec_vendor_id = 3256;
pub const cec_vendor_id_TOSHIBA2: cec_vendor_id = 3303;
pub const cec_vendor_id_APPLE: cec_vendor_id = 4346;
pub const cec_vendor_id_PULSE_EIGHT: cec_vendor_id = 5506;
pub const cec_vendor_id_HARMAN_KARDON2: cec_vendor_id = 6480;
pub const cec_vendor_id_GOOGLE: cec_vendor_id = 6673;
pub const cec_vendor_id_AKAI: cec_vendor_id = 8391;
pub const cec_vendor_id_AOC: cec_vendor_id = 9319;
pub const cec_vendor_id_PANASONIC: cec_vendor_id = 32837;
pub const cec_vendor_id_PHILIPS: cec_vendor_id = 36926;
pub const cec_vendor_id_DAEWOO: cec_vendor_id = 36947;
pub const cec_vendor_id_YAMAHA: cec_vendor_id = 41182;
pub const cec_vendor_id_GRUNDIG: cec_vendor_id = 53461;
pub const cec_vendor_id_PIONEER: cec_vendor_id = 57398;
pub const cec_vendor_id_LG: cec_vendor_id = 57489;
pub const cec_vendor_id_SHARP: cec_vendor_id = 524319;
pub const cec_vendor_id_SONY: cec_vendor_id = 524358;
pub const cec_vendor_id_BROADCOM: cec_vendor_id = 1622150;
pub const cec_vendor_id_SHARP2: cec_vendor_id = 5458000;
pub const cec_vendor_id_VIZIO: cec_vendor_id = 7042157;
pub const cec_vendor_id_BENQ: cec_vendor_id = 8414697;
pub const cec_vendor_id_HARMAN_KARDON: cec_vendor_id = 10249310;
pub const cec_vendor_id_UNKNOWN: cec_vendor_id = 0;
pub const cec_adapter_type_UNKNOWN: cec_adapter_type = 0;
pub const cec_adapter_type_P8_EXTERNAL: cec_adapter_type = 1;
pub const cec_adapter_type_P8_DAUGHTERBOARD: cec_adapter_type = 2;
pub const cec_adapter_type_RPI: cec_adapter_type = 256;
pub const cec_adapter_type_TDA995x: cec_adapter_type = 512;
pub const cec_adapter_type_EXYNOS: cec_adapter_type = 768;
pub const cec_adapter_type_LINUX: cec_adapter_type = 1024;
pub const cec_adapter_type_AOCEC: cec_adapter_type = 1280;
pub const cec_adapter_type_IMX: cec_adapter_type = 1536;
pub const libcec_version_CURRENT: libcec_version = 393218;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cec_log_message"][::std::mem::size_of::<cec_log_message>() - 24usize];
    ["Alignment of cec_log_message"][::std::mem::align_of::<cec_log_message>() - 8usize];
    ["Offset of field: cec_log_message::message"]
        [::std::mem::offset_of!(cec_log_message, message) - 0usize];
    ["Offset of field: cec_log_message::level"]
        [::std::mem::offset_of!(cec_log_message, level) - 8usize];
    ["Offset of field: cec_log_message::time"]
        [::std::mem::offset_of!(cec_log_message, time) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cec_keypress"][::std::mem::size_of::<cec_keypress>() - 8usize];
    ["Alignment of cec_keypress"][::std::mem::align_of::<cec_keypress>() - 4usize];
    ["Offset of field: cec_keypress::keycode"]
        [::std::mem::offset_of!(cec_keypress, keycode) - 0usize];
    ["Offset of field: cec_keypress::duration"]
        [::std::mem::offset_of!(cec_keypress, duration) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cec_adapter"][::std::mem::size_of::<cec_adapter>() - 2048usize];
    ["Alignment of cec_adapter"][::std::mem::align_of::<cec_adapter>() - 1usize];
    ["Offset of field: cec_adapter::path"][::std::mem::offset_of!(cec_adapter, path) - 0usize];
    ["Offset of field: cec_adapter::comm"][::std::mem::offset_of!(cec_adapter, comm) - 1024usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cec_adapter_descriptor"][::std::mem::size_of::<cec_adapter_descriptor>() - 2064usize];
    ["Alignment of cec_adapter_descriptor"]
        [::std::mem::align_of::<cec_adapter_descriptor>() - 4usize];
    ["Offset of field: cec_adapter_descriptor::strComPath"]
        [::std::mem::offset_of!(cec_adapter_descriptor, strComPath) - 0usize];
    ["Offset of field: cec_adapter_descriptor::strComName"]
        [::std::mem::offset_of!(cec_adapter_descriptor, strComName) - 1024usize];
    ["Offset of field: cec_adapter_descriptor::iVendorId"]
        [::std::mem::offset_of!(cec_adapter_descriptor, iVendorId) - 2048usize];
    ["Offset of field: cec_adapter_descriptor::iProductId"]
        [::std::mem::offset_of!(cec_adapter_descriptor, iProductId) - 2050usize];
    ["Offset of field: cec_adapter_descriptor::iFirmwareVersion"]
        [::std::mem::offset_of!(cec_adapter_descriptor, iFirmwareVersion) - 2052usize];
    ["Offset of field: cec_adapter_descriptor::iPhysicalAddress"]
        [::std::mem::offset_of!(cec_adapter_descriptor, iPhysicalAddress) - 2054usize];
    ["Offset of field: cec_adapter_descriptor::iFirmwareBuildDate"]
        [::std::mem::offset_of!(cec_adapter_descriptor, iFirmwareBuildDate) - 2056usize];
    ["Offset of field: cec_adapter_descriptor::adapterType"]
        [::std::mem::offset_of!(cec_adapter_descriptor, adapterType) - 2060usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cec_datapacket"][::std::mem::size_of::<cec_datapacket>() - 65usize];
    ["Alignment of cec_datapacket"][::std::mem::align_of::<cec_datapacket>() - 1usize];
    ["Offset of field: cec_datapacket::data"]
        [::std::mem::offset_of!(cec_datapacket, data) - 0usize];
    ["Offset of field: cec_datapacket::size"]
        [::std::mem::offset_of!(cec_datapacket, size) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cec_command"][::std::mem::size_of::<cec_command>() - 88usize];
    ["Alignment of cec_command"][::std::mem::align_of::<cec_command>() - 4usize];
    ["Offset of field: cec_command::initiator"]
        [::std::mem::offset_of!(cec_command, initiator) - 0usize];
    ["Offset of field: cec_command::destination"]
        [::std::mem::offset_of!(cec_command, destination) - 4usize];
    ["Offset of field: cec_command::ack"][::std::mem::offset_of!(cec_command, ack) - 8usize];
    ["Offset of field: cec_command::eom"][::std::mem::offset_of!(cec_command, eom) - 9usize];
    ["Offset of field: cec_command::opcode"][::std::mem::offset_of!(cec_command, opcode) - 12usize];
    ["Offset of field: cec_command::parameters"]
        [::std::mem::offset_of!(cec_command, parameters) - 16usize];
    ["Offset of field: cec_command::opcode_set"]
        [::std::mem::offset_of!(cec_command, opcode_set) - 81usize];
    ["Offset of field: cec_command::transmit_timeout"]
        [::std::mem::offset_of!(cec_command, transmit_timeout) - 84usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cec_device_type_list"][::std::mem::size_of::<cec_device_type_list>() - 20usize];
    ["Alignment of cec_device_type_list"][::std::mem::align_of::<cec_device_type_list>() - 4usize];
    ["Offset of field: cec_device_type_list::types"]
        [::std::mem::offset_of!(cec_device_type_list, types) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cec_logical_addresses"][::std::mem::size_of::<cec_logical_addresses>() - 68usize];
    ["Alignment of cec_logical_addresses"]
        [::std::mem::align_of::<cec_logical_addresses>() - 4usize];
    ["Offset of field: cec_logical_addresses::primary"]
        [::std::mem::offset_of!(cec_logical_addresses, primary) - 0usize];
    ["Offset of field: cec_logical_addresses::addresses"]
        [::std::mem::offset_of!(cec_logical_addresses, addresses) - 4usize];
};
pub const libcec_alert_SERVICE_DEVICE: libcec_alert = 0;
pub const libcec_alert_CONNECTION_LOST: libcec_alert = 1;
pub const libcec_alert_PERMISSION_ERROR: libcec_alert = 2;
pub const libcec_alert_PORT_BUSY: libcec_alert = 3;
pub const libcec_alert_PHYSICAL_ADDRESS_ERROR: libcec_alert = 4;
pub const libcec_alert_TV_POLL_FAILED: libcec_alert = 5;
pub const libcec_parameter_type_STRING: libcec_parameter_type = 0;
pub const libcec_parameter_type_UNKOWN: libcec_parameter_type = 1;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libcec_parameter"][::std::mem::size_of::<libcec_parameter>() - 16usize];
    ["Alignment of libcec_parameter"][::std::mem::align_of::<libcec_parameter>() - 8usize];
    ["Offset of field: libcec_parameter::paramType"]
        [::std::mem::offset_of!(libcec_parameter, paramType) - 0usize];
    ["Offset of field: libcec_parameter::paramData"]
        [::std::mem::offset_of!(libcec_parameter, paramData) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cec_adapter_stats"][::std::mem::size_of::<cec_adapter_stats>() - 20usize];
    ["Alignment of cec_adapter_stats"][::std::mem::align_of::<cec_adapter_stats>() - 4usize];
    ["Offset of field: cec_adapter_stats::tx_ack"]
        [::std::mem::offset_of!(cec_adapter_stats, tx_ack) - 0usize];
    ["Offset of field: cec_adapter_stats::tx_nack"]
        [::std::mem::offset_of!(cec_adapter_stats, tx_nack) - 4usize];
    ["Offset of field: cec_adapter_stats::tx_error"]
        [::std::mem::offset_of!(cec_adapter_stats, tx_error) - 8usize];
    ["Offset of field: cec_adapter_stats::rx_total"]
        [::std::mem::offset_of!(cec_adapter_stats, rx_total) - 12usize];
    ["Offset of field: cec_adapter_stats::rx_error"]
        [::std::mem::offset_of!(cec_adapter_stats, rx_error) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ICECCallbacks"][::std::mem::size_of::<ICECCallbacks>() - 56usize];
    ["Alignment of ICECCallbacks"][::std::mem::align_of::<ICECCallbacks>() - 8usize];
    ["Offset of field: ICECCallbacks::logMessage"]
        [::std::mem::offset_of!(ICECCallbacks, logMessage) - 0usize];
    ["Offset of field: ICECCallbacks::keyPress"]
        [::std::mem::offset_of!(ICECCallbacks, keyPress) - 8usize];
    ["Offset of field: ICECCallbacks::commandReceived"]
        [::std::mem::offset_of!(ICECCallbacks, commandReceived) - 16usize];
    ["Offset of field: ICECCallbacks::configurationChanged"]
        [::std::mem::offset_of!(ICECCallbacks, configurationChanged) - 24usize];
    ["Offset of field: ICECCallbacks::alert"]
        [::std::mem::offset_of!(ICECCallbacks, alert) - 32usize];
    ["Offset of field: ICECCallbacks::menuStateChanged"]
        [::std::mem::offset_of!(ICECCallbacks, menuStateChanged) - 40usize];
    ["Offset of field: ICECCallbacks::sourceActivated"]
        [::std::mem::offset_of!(ICECCallbacks, sourceActivated) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libcec_configuration"][::std::mem::size_of::<libcec_configuration>() - 336usize];
    ["Alignment of libcec_configuration"][::std::mem::align_of::<libcec_configuration>() - 8usize];
    ["Offset of field: libcec_configuration::clientVersion"]
        [::std::mem::offset_of!(libcec_configuration, clientVersion) - 0usize];
    ["Offset of field: libcec_configuration::strDeviceName"]
        [::std::mem::offset_of!(libcec_configuration, strDeviceName) - 4usize];
    ["Offset of field: libcec_configuration::deviceTypes"]
        [::std::mem::offset_of!(libcec_configuration, deviceTypes) - 20usize];
    ["Offset of field: libcec_configuration::bAutodetectAddress"]
        [::std::mem::offset_of!(libcec_configuration, bAutodetectAddress) - 40usize];
    ["Offset of field: libcec_configuration::iPhysicalAddress"]
        [::std::mem::offset_of!(libcec_configuration, iPhysicalAddress) - 42usize];
    ["Offset of field: libcec_configuration::baseDevice"]
        [::std::mem::offset_of!(libcec_configuration, baseDevice) - 44usize];
    ["Offset of field: libcec_configuration::iHDMIPort"]
        [::std::mem::offset_of!(libcec_configuration, iHDMIPort) - 48usize];
    ["Offset of field: libcec_configuration::tvVendor"]
        [::std::mem::offset_of!(libcec_configuration, tvVendor) - 52usize];
    ["Offset of field: libcec_configuration::wakeDevices"]
        [::std::mem::offset_of!(libcec_configuration, wakeDevices) - 56usize];
    ["Offset of field: libcec_configuration::powerOffDevices"]
        [::std::mem::offset_of!(libcec_configuration, powerOffDevices) - 124usize];
    ["Offset of field: libcec_configuration::serverVersion"]
        [::std::mem::offset_of!(libcec_configuration, serverVersion) - 192usize];
    ["Offset of field: libcec_configuration::bGetSettingsFromROM"]
        [::std::mem::offset_of!(libcec_configuration, bGetSettingsFromROM) - 196usize];
    ["Offset of field: libcec_configuration::bActivateSource"]
        [::std::mem::offset_of!(libcec_configuration, bActivateSource) - 197usize];
    ["Offset of field: libcec_configuration::bPowerOffOnStandby"]
        [::std::mem::offset_of!(libcec_configuration, bPowerOffOnStandby) - 198usize];
    ["Offset of field: libcec_configuration::callbackParam"]
        [::std::mem::offset_of!(libcec_configuration, callbackParam) - 200usize];
    ["Offset of field: libcec_configuration::callbacks"]
        [::std::mem::offset_of!(libcec_configuration, callbacks) - 208usize];
    ["Offset of field: libcec_configuration::logicalAddresses"]
        [::std::mem::offset_of!(libcec_configuration, logicalAddresses) - 216usize];
    ["Offset of field: libcec_configuration::iFirmwareVersion"]
        [::std::mem::offset_of!(libcec_configuration, iFirmwareVersion) - 284usize];
    ["Offset of field: libcec_configuration::strDeviceLanguage"]
        [::std::mem::offset_of!(libcec_configuration, strDeviceLanguage) - 286usize];
    ["Offset of field: libcec_configuration::iFirmwareBuildDate"]
        [::std::mem::offset_of!(libcec_configuration, iFirmwareBuildDate) - 292usize];
    ["Offset of field: libcec_configuration::bMonitorOnly"]
        [::std::mem::offset_of!(libcec_configuration, bMonitorOnly) - 296usize];
    ["Offset of field: libcec_configuration::cecVersion"]
        [::std::mem::offset_of!(libcec_configuration, cecVersion) - 300usize];
    ["Offset of field: libcec_configuration::adapterType"]
        [::std::mem::offset_of!(libcec_configuration, adapterType) - 304usize];
    ["Offset of field: libcec_configuration::comboKey"]
        [::std::mem::offset_of!(libcec_configuration, comboKey) - 308usize];
    ["Offset of field: libcec_configuration::iComboKeyTimeoutMs"]
        [::std::mem::offset_of!(libcec_configuration, iComboKeyTimeoutMs) - 312usize];
    ["Offset of field: libcec_configuration::iButtonRepeatRateMs"]
        [::std::mem::offset_of!(libcec_configuration, iButtonRepeatRateMs) - 316usize];
    ["Offset of field: libcec_configuration::iButtonReleaseDelayMs"]
        [::std::mem::offset_of!(libcec_configuration, iButtonReleaseDelayMs) - 320usize];
    ["Offset of field: libcec_configuration::iDoubleTapTimeoutMs"]
        [::std::mem::offset_of!(libcec_configuration, iDoubleTapTimeoutMs) - 324usize];
    ["Offset of field: libcec_configuration::bAutoWakeAVR"]
        [::std::mem::offset_of!(libcec_configuration, bAutoWakeAVR) - 328usize];
    ["Offset of field: libcec_configuration::bAutoPowerOn"]
        [::std::mem::offset_of!(libcec_configuration, bAutoPowerOn) - 329usize];
};
impl Default for cec_log_message {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl Default for cec_keypress {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl Default for cec_adapter {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl Default for cec_adapter_descriptor {
    fn default() -> Self {
